{"pageProps":{"slug":"2016-01-03-introduction","frontmatter":{"layout":"post","comments":true,"title":"Introduction","published":false},"content":"\n*The Strange Case of Dr. Jekyll and Mr. Hyde* tells the story of a lawyer investigating the connection of two persons, Dr. Henry Jekyll and Mr. Edward Hyde. Chief among the novel's supporting cast is a man by the name of Mr. Poole, Dr. Jekyll's loyal butler.\n\n-----\n\nPoole is the butler for [Jekyll](http://jekyllrb.com), the static site generator. It's designed and developed by [@mdo](https://twitter.com/mdo) to provide a clear and concise foundational setup for any Jekyll site. It does so by furnishing a full vanilla Jekyll install with example layouts, pages, posts, and styles.\n\nThere are currently three themes built on Poole:\n\n* [Hyde](http://hyde.getpoole.com)\n* [Lanyon](http://lanyon.getpoole.com)\n* [Enfield](http://enfield.getpoole.com)\n\nLearn more and contribute on [GitHub]({{ site.github.repo }}).\n\n### What's included\n\nPoole is a streamlined Jekyll site designed and built as a foundation for building more meaningful themes. Poole, and every theme built on it like this one, includes the following:\n\n* Complete Jekyll setup included (layouts, config, [404]({{ site.baseurl }}/404.html), [RSS feed]({{ site.baseurl }}/atom.xml), posts, and [example page]({{ site.baseurl }}/about))\n* Mobile friendly design and development\n* Easily scalable text and component sizing with `rem` units in the CSS\n* Support for a wide gamut of HTML elements\n* Related posts (time-based, because Jekyll) below each post\n* Syntax highlighting, courtesy Jekyll's built-in support for Rouge\n\nAdditional features are available in individual themes.\n\n### Browser support\n\nPoole and its themes are by preference a forward-thinking project. In addition to the latest versions of Chrome, Safari (mobile and desktop), and Firefox, it is only compatible with Internet Explorer 9 and above.\n\n### Download\n\nThese themes are developed on and hosted with GitHub. Head to the [GitHub repository]({{ site.github.repo }}) for downloads, bug reports, and features requests.\n\nThanks!\n"},"__N_SSG":true}