{"pageProps":{"slug":"2021-05-07-pub-ali21_bezelglide","frontmatter":{"title":"BezelGlide: Interacting with Graphs on Smartwatches with Minimal Screen Occlusion","date":"2021-05-07","authors":"Ali Neshati; Bradley Rey; <b>Ahmed Shariff Mohommed Faleel</b>; Sandra Bardot; Celine Latulipe; Pourang Irani","venue":"CHI '21","type":"Conference","paperurl":"https://doi.org/10.1145/3411764.3445201","doi":"10.1145/3411764.3445201","citation":"Ali Neshati, Bradley Rey, Ahmed Shariff Mohommed Faleel, Sandra Bardot, Celine Latulipe, and Pourang Irani. 2021. BezelGlide: Interacting with Graphs on Smartwatches with Minimal Screen Occlusion. In <i>Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems</i> (<i>CHI '21</i>). Association for Computing Machinery, New York, NY, USA, Article 501, 1–13. https://doi.org/10.1145/3411764.3445201","abstract":"Mid-air gestures have been heavily studied in HCI but with mostly younger adults (YAs). Older adults (OAs) can equally benefit from such a modality, but given their heterogeneous motor abilities, designing suitable gestures is challenging [2]. Our research specifically looks at age-related differences in hand gesture preferences between older and younger adults. This subject is important since it relates to the idea of a proper age-inclusive technological design and the means towards the successful adoption of technologies by all the layers of the population, including older adults.","pdf":"/pdf/ali21_bezelglide.pdf"},"content":"\r\n```latex\r\n@inproceedings{ali21_bezelglide,\r\n   author = {Neshati, Ali and Rey, Bradley and Mohommed Faleel, Ahmed Shariff and Bardot, Sandra and Latulipe, Celine and Irani, Pourang},\r\n   title = {BezelGlide: Interacting with Graphs on Smartwatches with Minimal Screen Occlusion},\r\n   year = {2021},\r\n   isbn = {9781450380966},\r\n   publisher = {Association for Computing Machinery},\r\n   address = {New York, NY, USA},\r\n   url = {https://doi.org/10.1145/3411764.3445201},\r\n   doi = {10.1145/3411764.3445201},\r\n   abstract = { We present BezelGlide, a novel suite of bezel interaction techniques, designed to minimize screen occlusion and ‘fat finger’ effects, when interacting with common graphs on smartwatches. To explore the design of BezelGlide, we conducted two user studies. First, we quantified the amount of screen occlusion experienced when interacting with the smartwatch bezel. Next, we designed two techniques that involve gliding the finger along the smartwatch bezel for graph interaction. Full BezelGlide (FBG) and Partial BezelGlide (PBG), use the full or a portion of the bezel, respectively, to reduce screen occlusion while scanning a line chart for data. In the common value detection task, we find that PBG outperforms FBG and Shift, a touchscreen occlusion-free technique, both quantitatively and subjectively, also while mobile. We finally illustrate the generzability potential of PBG to interact with common graph types making it a valuable interaction technique for smartwatch users.},\r\n   booktitle = {Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems},\r\n   articleno = {501},\r\n   numpages = {13},\r\n   keywords = {input, interaction, data charts, smartwatch, visuzation},\r\n   location = {Yokohama, Japan},\r\n   series = {CHI '21}\r\n}\r\n```\r\n"},"__N_SSG":true}